[command]/home/runner/work/_temp/f3602f6b-3cff-404c-bd9c-22460ceeadf9/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_lb.main_lb will be created
  + resource "azurerm_lb" "main_lb" {
      + id                   = (known after apply)
      + location             = "westeurope"
      + name                 = "main-lb"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "rg-mblanco-dvfinlab"
      + sku                  = "Standard"
      + sku_tier             = "Regional"

      + frontend_ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "PublicIPAddress"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = (known after apply)
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_lb_backend_address_pool.main_backend_pool will be created
  + resource "azurerm_lb_backend_address_pool" "main_backend_pool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + inbound_nat_rules         = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "backend-pool"
      + outbound_rules            = (known after apply)
    }

  # azurerm_lb_nat_rule.ssh_nat_rule["vm1"] will be created
  + resource "azurerm_lb_nat_rule" "ssh_nat_rule" {
      + backend_ip_configuration_id    = (known after apply)
      + backend_port                   = 22
      + enable_floating_ip             = (known after apply)
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "PublicIPAddress"
      + frontend_port                  = 2221
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + loadbalancer_id                = (known after apply)
      + name                           = "ssh-nat-rule-vm1"
      + protocol                       = "Tcp"
      + resource_group_name            = "rg-mblanco-dvfinlab"
    }

  # azurerm_lb_nat_rule.ssh_nat_rule["vm2"] will be created
  + resource "azurerm_lb_nat_rule" "ssh_nat_rule" {
      + backend_ip_configuration_id    = (known after apply)
      + backend_port                   = 22
      + enable_floating_ip             = (known after apply)
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "PublicIPAddress"
      + frontend_port                  = 2222
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + loadbalancer_id                = (known after apply)
      + name                           = "ssh-nat-rule-vm2"
      + protocol                       = "Tcp"
      + resource_group_name            = "rg-mblanco-dvfinlab"
    }

  # azurerm_lb_probe.http_probe will be created
  + resource "azurerm_lb_probe" "http_probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 5
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "http-health-probe"
      + number_of_probes    = 2
      + port                = 80
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # azurerm_linux_virtual_machine.vm["vm1"] will be created
  + resource "azurerm_linux_virtual_machine" "vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "adminuser1"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + custom_data                                            = (sensitive value)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "westeurope"
      + max_bid_price                                          = -1
      + name                                                   = "vm-vm1"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-mblanco-dvfinlab"
      + size                                                   = "Standard_DS1_v2"
      + tags                                                   = {
          + "Environment" = "Test"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # azurerm_linux_virtual_machine.vm["vm2"] will be created
  + resource "azurerm_linux_virtual_machine" "vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "adminuser2"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + custom_data                                            = (sensitive value)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "westeurope"
      + max_bid_price                                          = -1
      + name                                                   = "vm-vm2"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-mblanco-dvfinlab"
      + size                                                   = "Standard_DS1_v2"
      + tags                                                   = {
          + "Environment" = "Test"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # azurerm_network_interface.nic["vm1"] will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers         = (known after apply)
      + id                          = (known after apply)
      + internal_domain_name_suffix = (known after apply)
      + location                    = "westeurope"
      + mac_address                 = (known after apply)
      + name                        = "nic-vm1"
      + private_ip_address          = (known after apply)
      + private_ip_addresses        = (known after apply)
      + resource_group_name         = "rg-mblanco-dvfinlab"
      + virtual_machine_id          = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_network_interface.nic["vm2"] will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers         = (known after apply)
      + id                          = (known after apply)
      + internal_domain_name_suffix = (known after apply)
      + location                    = "westeurope"
      + mac_address                 = (known after apply)
      + name                        = "nic-vm2"
      + private_ip_address          = (known after apply)
      + private_ip_addresses        = (known after apply)
      + resource_group_name         = "rg-mblanco-dvfinlab"
      + virtual_machine_id          = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_network_interface_backend_address_pool_association.nic_backend_pool["vm1"] will be created
  + resource "azurerm_network_interface_backend_address_pool_association" "nic_backend_pool" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_configuration_name   = "internal"
      + network_interface_id    = (known after apply)
    }

  # azurerm_network_interface_backend_address_pool_association.nic_backend_pool["vm2"] will be created
  + resource "azurerm_network_interface_backend_address_pool_association" "nic_backend_pool" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_configuration_name   = "internal"
      + network_interface_id    = (known after apply)
    }

  # azurerm_network_security_group.nsg will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "main-nsg"
      + resource_group_name = "rg-mblanco-dvfinlab"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowSSH"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
    }

  # azurerm_public_ip.main_lb_public_ip will be created
  + resource "azurerm_public_ip" "main_lb_public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "main-lb-public-ip"
      + resource_group_name     = "rg-mblanco-dvfinlab"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_subnet.main_subnet will be created
  + resource "azurerm_subnet" "main_subnet" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "main-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-mblanco-dvfinlab"
      + virtual_network_name                          = "main-vnet"
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "main-vnet"
      + resource_group_name = "rg-mblanco-dvfinlab"
      + subnet              = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + lb_public_ip = (known after apply)
  + vm_ids       = [
      + (known after apply),
      + (known after apply),
    ]
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # azurerm_lb.main_lb will be created%0A  + resource "azurerm_lb" "main_lb" {%0A      + id                   = (known after apply)%0A      + location             = "westeurope"%0A      + name                 = "main-lb"%0A      + private_ip_address   = (known after apply)%0A      + private_ip_addresses = (known after apply)%0A      + resource_group_name  = "rg-mblanco-dvfinlab"%0A      + sku                  = "Standard"%0A      + sku_tier             = "Regional"%0A%0A      + frontend_ip_configuration {%0A          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)%0A          + id                                                 = (known after apply)%0A          + inbound_nat_rules                                  = (known after apply)%0A          + load_balancer_rules                                = (known after apply)%0A          + name                                               = "PublicIPAddress"%0A          + outbound_rules                                     = (known after apply)%0A          + private_ip_address                                 = (known after apply)%0A          + private_ip_address_allocation                      = (known after apply)%0A          + private_ip_address_version                         = (known after apply)%0A          + public_ip_address_id                               = (known after apply)%0A          + public_ip_prefix_id                                = (known after apply)%0A          + subnet_id                                          = (known after apply)%0A        }%0A    }%0A%0A  # azurerm_lb_backend_address_pool.main_backend_pool will be created%0A  + resource "azurerm_lb_backend_address_pool" "main_backend_pool" {%0A      + backend_ip_configurations = (known after apply)%0A      + id                        = (known after apply)%0A      + inbound_nat_rules         = (known after apply)%0A      + load_balancing_rules      = (known after apply)%0A      + loadbalancer_id           = (known after apply)%0A      + name                      = "backend-pool"%0A      + outbound_rules            = (known after apply)%0A    }%0A%0A  # azurerm_lb_nat_rule.ssh_nat_rule["vm1"] will be created%0A  + resource "azurerm_lb_nat_rule" "ssh_nat_rule" {%0A      + backend_ip_configuration_id    = (known after apply)%0A      + backend_port                   = 22%0A      + enable_floating_ip             = (known after apply)%0A      + frontend_ip_configuration_id   = (known after apply)%0A      + frontend_ip_configuration_name = "PublicIPAddress"%0A      + frontend_port                  = 2221%0A      + id                             = (known after apply)%0A      + idle_timeout_in_minutes        = 4%0A      + loadbalancer_id                = (known after apply)%0A      + name                           = "ssh-nat-rule-vm1"%0A      + protocol                       = "Tcp"%0A      + resource_group_name            = "rg-mblanco-dvfinlab"%0A    }%0A%0A  # azurerm_lb_nat_rule.ssh_nat_rule["vm2"] will be created%0A  + resource "azurerm_lb_nat_rule" "ssh_nat_rule" {%0A      + backend_ip_configuration_id    = (known after apply)%0A      + backend_port                   = 22%0A      + enable_floating_ip             = (known after apply)%0A      + frontend_ip_configuration_id   = (known after apply)%0A      + frontend_ip_configuration_name = "PublicIPAddress"%0A      + frontend_port                  = 2222%0A      + id                             = (known after apply)%0A      + idle_timeout_in_minutes        = 4%0A      + loadbalancer_id                = (known after apply)%0A      + name                           = "ssh-nat-rule-vm2"%0A      + protocol                       = "Tcp"%0A      + resource_group_name            = "rg-mblanco-dvfinlab"%0A    }%0A%0A  # azurerm_lb_probe.http_probe will be created%0A  + resource "azurerm_lb_probe" "http_probe" {%0A      + id                  = (known after apply)%0A      + interval_in_seconds = 5%0A      + load_balancer_rules = (known after apply)%0A      + loadbalancer_id     = (known after apply)%0A      + name                = "http-health-probe"%0A      + number_of_probes    = 2%0A      + port                = 80%0A      + probe_threshold     = 1%0A      + protocol            = "Tcp"%0A    }%0A%0A  # azurerm_linux_virtual_machine.vm["vm1"] will be created%0A  + resource "azurerm_linux_virtual_machine" "vm" {%0A      + admin_password                                         = (sensitive value)%0A      + admin_username                                         = "adminuser1"%0A      + allow_extension_operations                             = true%0A      + bypass_platform_safety_checks_on_user_schedule_enabled = false%0A      + computer_name                                          = (known after apply)%0A      + custom_data                                            = (sensitive value)%0A      + disable_password_authentication                        = false%0A      + disk_controller_type                                   = (known after apply)%0A      + extensions_time_budget                                 = "PT1H30M"%0A      + id                                                     = (known after apply)%0A      + location                                               = "westeurope"%0A      + max_bid_price                                          = -1%0A      + name                                                   = "vm-vm1"%0A      + network_interface_ids                                  = (known after apply)%0A      + patch_assessment_mode                                  = "ImageDefault"%0A      + patch_mode                                             = "ImageDefault"%0A      + platform_fault_domain                                  = -1%0A      + priority                                               = "Regular"%0A      + private_ip_address                                     = (known after apply)%0A      + private_ip_addresses                                   = (known after apply)%0A      + provision_vm_agent                                     = true%0A      + public_ip_address                                      = (known after apply)%0A      + public_ip_addresses                                    = (known after apply)%0A      + resource_group_name                                    = "rg-mblanco-dvfinlab"%0A      + size                                                   = "Standard_DS1_v2"%0A      + tags                                                   = {%0A          + "Environment" = "Test"%0A        }%0A      + virtual_machine_id                                     = (known after apply)%0A      + vm_agent_platform_updates_enabled                      = false%0A%0A      + os_disk {%0A          + caching                   = "ReadWrite"%0A          + disk_size_gb              = (known after apply)%0A          + name                      = (known after apply)%0A          + storage_account_type      = "Standard_LRS"%0A          + write_accelerator_enabled = false%0A        }%0A%0A      + source_image_reference {%0A          + offer     = "UbuntuServer"%0A          + publisher = "Canonical"%0A          + sku       = "18.04-LTS"%0A          + version   = "latest"%0A        }%0A%0A      + termination_notification (known after apply)%0A    }%0A%0A  # azurerm_linux_virtual_machine.vm["vm2"] will be created%0A  + resource "azurerm_linux_virtual_machine" "vm" {%0A      + admin_password                                         = (sensitive value)%0A      + admin_username                                         = "adminuser2"%0A      + allow_extension_operations                             = true%0A      + bypass_platform_safety_checks_on_user_schedule_enabled = false%0A      + computer_name                                          = (known after apply)%0A      + custom_data                                            = (sensitive value)%0A      + disable_password_authentication                        = false%0A      + disk_controller_type                                   = (known after apply)%0A      + extensions_time_budget                                 = "PT1H30M"%0A      + id                                                     = (known after apply)%0A      + location                                               = "westeurope"%0A      + max_bid_price                                          = -1%0A      + name                                                   = "vm-vm2"%0A      + network_interface_ids                                  = (known after apply)%0A      + patch_assessment_mode                                  = "ImageDefault"%0A      + patch_mode                                             = "ImageDefault"%0A      + platform_fault_domain                                  = -1%0A      + priority                                               = "Regular"%0A      + private_ip_address                                     = (known after apply)%0A      + private_ip_addresses                                   = (known after apply)%0A      + provision_vm_agent                                     = true%0A      + public_ip_address                                      = (known after apply)%0A      + public_ip_addresses                                    = (known after apply)%0A      + resource_group_name                                    = "rg-mblanco-dvfinlab"%0A      + size                                                   = "Standard_DS1_v2"%0A      + tags                                                   = {%0A          + "Environment" = "Test"%0A        }%0A      + virtual_machine_id                                     = (known after apply)%0A      + vm_agent_platform_updates_enabled                      = false%0A%0A      + os_disk {%0A          + caching                   = "ReadWrite"%0A          + disk_size_gb              = (known after apply)%0A          + name                      = (known after apply)%0A          + storage_account_type      = "Standard_LRS"%0A          + write_accelerator_enabled = false%0A        }%0A%0A      + source_image_reference {%0A          + offer     = "UbuntuServer"%0A          + publisher = "Canonical"%0A          + sku       = "18.04-LTS"%0A          + version   = "latest"%0A        }%0A%0A      + termination_notification (known after apply)%0A    }%0A%0A  # azurerm_network_interface.nic["vm1"] will be created%0A  + resource "azurerm_network_interface" "nic" {%0A      + applied_dns_servers         = (known after apply)%0A      + id                          = (known after apply)%0A      + internal_domain_name_suffix = (known after apply)%0A      + location                    = "westeurope"%0A      + mac_address                 = (known after apply)%0A      + name                        = "nic-vm1"%0A      + private_ip_address          = (known after apply)%0A      + private_ip_addresses        = (known after apply)%0A      + resource_group_name         = "rg-mblanco-dvfinlab"%0A      + virtual_machine_id          = (known after apply)%0A%0A      + ip_configuration {%0A          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)%0A          + name                                               = "internal"%0A          + primary                                            = (known after apply)%0A          + private_ip_address                                 = (known after apply)%0A          + private_ip_address_allocation                      = "Dynamic"%0A          + private_ip_address_version                         = "IPv4"%0A          + subnet_id                                          = (known after apply)%0A        }%0A    }%0A%0A  # azurerm_network_interface.nic["vm2"] will be created%0A  + resource "azurerm_network_interface" "nic" {%0A      + applied_dns_servers         = (known after apply)%0A      + id                          = (known after apply)%0A      + internal_domain_name_suffix = (known after apply)%0A      + location                    = "westeurope"%0A      + mac_address                 = (known after apply)%0A      + name                        = "nic-vm2"%0A      + private_ip_address          = (known after apply)%0A      + private_ip_addresses        = (known after apply)%0A      + resource_group_name         = "rg-mblanco-dvfinlab"%0A      + virtual_machine_id          = (known after apply)%0A%0A      + ip_configuration {%0A          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)%0A          + name                                               = "internal"%0A          + primary                                            = (known after apply)%0A          + private_ip_address                                 = (known after apply)%0A          + private_ip_address_allocation                      = "Dynamic"%0A          + private_ip_address_version                         = "IPv4"%0A          + subnet_id                                          = (known after apply)%0A        }%0A    }%0A%0A  # azurerm_network_interface_backend_address_pool_association.nic_backend_pool["vm1"] will be created%0A  + resource "azurerm_network_interface_backend_address_pool_association" "nic_backend_pool" {%0A      + backend_address_pool_id = (known after apply)%0A      + id                      = (known after apply)%0A      + ip_configuration_name   = "internal"%0A      + network_interface_id    = (known after apply)%0A    }%0A%0A  # azurerm_network_interface_backend_address_pool_association.nic_backend_pool["vm2"] will be created%0A  + resource "azurerm_network_interface_backend_address_pool_association" "nic_backend_pool" {%0A      + backend_address_pool_id = (known after apply)%0A      + id                      = (known after apply)%0A      + ip_configuration_name   = "internal"%0A      + network_interface_id    = (known after apply)%0A    }%0A%0A  # azurerm_network_security_group.nsg will be created%0A  + resource "azurerm_network_security_group" "nsg" {%0A      + id                  = (known after apply)%0A      + location            = "westeurope"%0A      + name                = "main-nsg"%0A      + resource_group_name = "rg-mblanco-dvfinlab"%0A      + security_rule       = [%0A          + {%0A              + access                                     = "Allow"%0A              + destination_address_prefix                 = "*"%0A              + destination_address_prefixes               = []%0A              + destination_application_security_group_ids = []%0A              + destination_port_range                     = "22"%0A              + destination_port_ranges                    = []%0A              + direction                                  = "Inbound"%0A              + name                                       = "AllowSSH"%0A              + priority                                   = 1001%0A              + protocol                                   = "Tcp"%0A              + source_address_prefix                      = "*"%0A              + source_address_prefixes                    = []%0A              + source_application_security_group_ids      = []%0A              + source_port_range                          = "*"%0A              + source_port_ranges                         = []%0A                # (1 unchanged attribute hidden)%0A            },%0A        ]%0A    }%0A%0A  # azurerm_public_ip.main_lb_public_ip will be created%0A  + resource "azurerm_public_ip" "main_lb_public_ip" {%0A      + allocation_method       = "Static"%0A      + ddos_protection_mode    = "VirtualNetworkInherited"%0A      + fqdn                    = (known after apply)%0A      + id                      = (known after apply)%0A      + idle_timeout_in_minutes = 4%0A      + ip_address              = (known after apply)%0A      + ip_version              = "IPv4"%0A      + location                = "westeurope"%0A      + name                    = "main-lb-public-ip"%0A      + resource_group_name     = "rg-mblanco-dvfinlab"%0A      + sku                     = "Standard"%0A      + sku_tier                = "Regional"%0A    }%0A%0A  # azurerm_subnet.main_subnet will be created%0A  + resource "azurerm_subnet" "main_subnet" {%0A      + address_prefixes                              = [%0A          + "10.0.1.0/24",%0A        ]%0A      + default_outbound_access_enabled               = true%0A      + id                                            = (known after apply)%0A      + name                                          = "main-subnet"%0A      + private_endpoint_network_policies             = "Disabled"%0A      + private_link_service_network_policies_enabled = true%0A      + resource_group_name                           = "rg-mblanco-dvfinlab"%0A      + virtual_network_name                          = "main-vnet"%0A    }%0A%0A  # azurerm_virtual_network.vnet will be created%0A  + resource "azurerm_virtual_network" "vnet" {%0A      + address_space       = [%0A          + "10.0.0.0/16",%0A        ]%0A      + dns_servers         = (known after apply)%0A      + guid                = (known after apply)%0A      + id                  = (known after apply)%0A      + location            = "westeurope"%0A      + name                = "main-vnet"%0A      + resource_group_name = "rg-mblanco-dvfinlab"%0A      + subnet              = (known after apply)%0A    }%0A%0APlan: 15 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + lb_public_ip = (known after apply)%0A  + vm_ids       = [%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A
::debug::stderr: 
::debug::exitcode: 0
<!-- Sticky Pull Request CommentTerraform Plan Result -->